app/views/users/index.html.erb

<header id="content-header">
  <h1><%= pluralize(@users.count, "user") %> currently registered.</h1>
---
SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "users"