app/controllers/favorites_controller.rb

	def create
		@movie.favorites.create!(user: current_user)
---
INSERT INTO "favorites" ("created_at", "movie_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2015-09-08 01:31:48.870289"], ["movie_id", 1], ["updated_at", "2015-09-08 01:31:48.870289"], ["user_id", 3]]

	def destroy
	current_user.favorites.find_by(params[:id]).destroy
---
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 59]]
SELECT  "favorites".* FROM "favorites"  WHERE "favorites"."user_id" = ? AND (64) LIMIT 1  [["user_id", 3]]