app/controllers/reviews_controller.rb

  def create
    @review = @movie.reviews.new(review_params)
    @review.user = current_user
    if @review.save
---
INSERT INTO "reviews" ("comment", "created_at", "movie_id", "name", "stars", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["comment", "I like Ironman"], ["created_at", "2015-07-24 11:02:46.196063"], ["movie_id", 1], ["name", "Jeff"], ["stars", 1], ["updated_at", "2015-07-24 11:02:46.196063"]]