app/controllers/users_controller.rb

UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = 2  [["name", "Leraaaaa"], ["updated_at", "2015-07-24 17:04:10.266603"]]
---
	def update
		if @user.update(user_params)